testing VPC peering w/GCP module
```
fdiaz at REMMAC11ELVDT ~ 💰  terraform plan -out franklin.out                                                              deployment
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.attacker.data.google_compute_image.attacker_ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.attacker.google_compute_instance.attacker[0] will be created
  + resource "google_compute_instance" "attacker" {
      + allow_stopping_for_update = true
      + can_ip_forward            = true
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "n1-standard-1"
      + metadata                  = {
          + "block-project-ssh-keys" = "false"
          + "serial-port-enable"     = "true"
          + "ssh-keys"               = "admin:ssh-rsa "
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "attacker-linux"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/secops-iac-ctf-000378/global/images/secops-ctf-attacker-ubuntu-18"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.10.24.13"
          + subnetwork         = "public-attacker"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.bootstrap.google_storage_bucket.bootstrap will be created
  + resource "google_storage_bucket" "bootstrap" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + location           = "US-CENTRAL1"
      + name               = "bootstrap-bucket-secops-iac-ctf-000378"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "REGIONAL"
      + url                = (known after apply)
    }

  # module.bootstrap.google_storage_bucket_object.bootstrap_dirs["config/"] will be created
  + resource "google_storage_bucket_object" "bootstrap_dirs" {
      + bucket         = "bootstrap-bucket-secops-iac-ctf-000378"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "config/"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/dev/null"
      + storage_class  = (known after apply)
    }

  # module.bootstrap.google_storage_bucket_object.bootstrap_dirs["content/"] will be created
  + resource "google_storage_bucket_object" "bootstrap_dirs" {
      + bucket         = "bootstrap-bucket-secops-iac-ctf-000378"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "content/"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/dev/null"
      + storage_class  = (known after apply)
    }

  # module.bootstrap.google_storage_bucket_object.bootstrap_dirs["license/"] will be created
  + resource "google_storage_bucket_object" "bootstrap_dirs" {
      + bucket         = "bootstrap-bucket-secops-iac-ctf-000378"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "license/"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/dev/null"
      + storage_class  = (known after apply)
    }

  # module.bootstrap.google_storage_bucket_object.bootstrap_dirs["plugins/"] will be created
  + resource "google_storage_bucket_object" "bootstrap_dirs" {
      + bucket         = "bootstrap-bucket-secops-iac-ctf-000378"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "plugins/"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/dev/null"
      + storage_class  = (known after apply)
    }

  # module.bootstrap.google_storage_bucket_object.bootstrap_dirs["software/"] will be created
  + resource "google_storage_bucket_object" "bootstrap_dirs" {
      + bucket         = "bootstrap-bucket-secops-iac-ctf-000378"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "software/"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/dev/null"
      + storage_class  = (known after apply)
    }

  # module.bootstrap.google_storage_bucket_object.init_cfg will be created
  + resource "google_storage_bucket_object" "init_cfg" {
      + bucket         = "bootstrap-bucket-secops-iac-ctf-000378"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "config/init-cfg.txt"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.firewall.google_compute_instance.firewall will be created
  + resource "google_compute_instance" "firewall" {
      + allow_stopping_for_update = true
      + can_ip_forward            = true
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "n1-standard-4"
      + metadata                  = {
          + "block-project-ssh-keys"               = "true"
          + "serial-port-enable"                   = "true"
          + "ssh-keys"                             = "admin:ssh-rsa "
          + "vmseries-bootstrap-gce-storagebucket" = "bootstrap-bucket-secops-iac-ctf-000378"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = "Intel Skylake"
      + name                      = "vm-series"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/paloaltonetworksgcp-public/global/images/vmseries-bundle2-901"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.10.116.253"
          + subnetwork         = "management"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.10.200.253"
          + subnetwork         = "public-public"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.10.20.253"
          + subnetwork         = "private-domain"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.vpc.google_compute_firewall.mgmt-allow-inbound will be created
  + resource "google_compute_firewall" "mgmt-allow-inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "mgmt-allow-inbound"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "443",
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc.google_compute_firewall.private-allow-inbound will be created
  + resource "google_compute_firewall" "private-allow-inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "private-allow-inbound"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "443",
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc.google_compute_firewall.public-allow-inbound will be created
  + resource "google_compute_firewall" "public-allow-inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "public-allow-inbound"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "443",
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc.module.peering-priv-db.google_compute_network_peering.local_network_peering will be created
  + resource "google_compute_network_peering" "local_network_peering" {
      + auto_create_routes   = (known after apply)
      + export_custom_routes = false
      + id                   = (known after apply)
      + import_custom_routes = false
      + name                 = (known after apply)
      + network              = (known after apply)
      + peer_network         = (known after apply)
      + state                = (known after apply)
      + state_details        = (known after apply)
    }

  # module.vpc.module.peering-priv-db.google_compute_network_peering.peer_network_peering will be created
  + resource "google_compute_network_peering" "peer_network_peering" {
      + auto_create_routes   = (known after apply)
      + export_custom_routes = false
      + id                   = (known after apply)
      + import_custom_routes = false
      + name                 = (known after apply)
      + network              = (known after apply)
      + peer_network         = (known after apply)
      + state                = (known after apply)
      + state_details        = (known after apply)
    }

  # module.vpc.module.peering-priv-db.null_resource.complete will be created
  + resource "null_resource" "complete" {
      + id = (known after apply)
    }

  # module.vpc.module.peering-priv-db.null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "1"
        }
    }

  # module.vpc.module.peering-priv-web.google_compute_network_peering.local_network_peering will be created
  + resource "google_compute_network_peering" "local_network_peering" {
      + auto_create_routes   = (known after apply)
      + export_custom_routes = false
      + id                   = (known after apply)
      + import_custom_routes = false
      + name                 = (known after apply)
      + network              = (known after apply)
      + peer_network         = (known after apply)
      + state                = (known after apply)
      + state_details        = (known after apply)
    }

  # module.vpc.module.peering-priv-web.google_compute_network_peering.peer_network_peering will be created
  + resource "google_compute_network_peering" "peer_network_peering" {
      + auto_create_routes   = (known after apply)
      + export_custom_routes = false
      + id                   = (known after apply)
      + import_custom_routes = false
      + name                 = (known after apply)
      + network              = (known after apply)
      + peer_network         = (known after apply)
      + state                = (known after apply)
      + state_details        = (known after apply)
    }

  # module.vpc.module.peering-priv-web.null_resource.complete will be created
  + resource "null_resource" "complete" {
      + id = (known after apply)
    }

  # module.vpc.module.peering-priv-web.null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "0"
        }
    }

  # module.vpc.module.db-vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/db"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.101.0/24"
      + name                     = "db"
      + network                  = "db"
      + private_ip_google_access = true
      + project                  = "secops-iac-ctf-000378"
      + region                   = "us-central1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.db-vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "db"
      + project                         = "secops-iac-ctf-000378"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.mgmt-vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/management"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.116.0/24"
      + name                     = "management"
      + network                  = "management"
      + private_ip_google_access = true
      + project                  = "secops-iac-ctf-000378"
      + region                   = "us-central1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.mgmt-vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "management"
      + project                         = "secops-iac-ctf-000378"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.priv-vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/private-domain"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.20.0/24"
      + name                     = "private-domain"
      + network                  = "private"
      + private_ip_google_access = false
      + project                  = "secops-iac-ctf-000378"
      + region                   = "us-central1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.priv-vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/private-hosts"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.10.0/24"
      + name                     = "private-hosts"
      + network                  = "private"
      + private_ip_google_access = true
      + project                  = "secops-iac-ctf-000378"
      + region                   = "us-central1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.priv-vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "private"
      + project                         = "secops-iac-ctf-000378"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.pub-vpc.module.routes.google_compute_route.route["management-egress-inet"] will be created
  + resource "google_compute_route" "route" {
      + description      = "route through IGW to access internet"
      + dest_range       = "0.0.0.0/0"
      + id               = (known after apply)
      + name             = "management-egress-inet"
      + network          = "public"
      + next_hop_gateway = "default-internet-gateway"
      + next_hop_ip      = (known after apply)
      + next_hop_network = (known after apply)
      + priority         = 1000
      + project          = "secops-iac-ctf-000378"
      + self_link        = (known after apply)
      + tags             = [
          + "egress-inet",
        ]
    }

  # module.vpc.module.pub-vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/public-attacker"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.24.0/24"
      + name                     = "public-attacker"
      + network                  = "public"
      + private_ip_google_access = true
      + project                  = "secops-iac-ctf-000378"
      + region                   = "us-central1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.pub-vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/public-public"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.200.0/24"
      + name                     = "public-public"
      + network                  = "public"
      + private_ip_google_access = true
      + project                  = "secops-iac-ctf-000378"
      + region                   = "us-central1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.pub-vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "public"
      + project                         = "secops-iac-ctf-000378"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.web-vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/web"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.100.0/24"
      + name                     = "web"
      + network                  = "web"
      + private_ip_google_access = true
      + project                  = "secops-iac-ctf-000378"
      + region                   = "us-central1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.web-vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "web"
      + project                         = "secops-iac-ctf-000378"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

This plan was saved to: franklin.out

To perform exactly these actions, run the following command to apply:
    terraform apply "franklin.out"

fdiaz at REMMAC11ELVDT ~ 💰         
```